{"keras_version": "2.2.4", "class_name": "Model", "backend": "tensorflow", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["dense_19", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 96, 96, 3], "dtype": "float32", "name": "input_1", "sparse": false}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_1", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 64, "name": "conv2d_1", "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_1", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99}}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "Activation", "name": "activation_1", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_2", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [1, 1], "filters": 64, "name": "conv2d_2", "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_4", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [1, 1], "filters": 64, "name": "conv2d_4", "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_6", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [1, 1], "filters": 64, "name": "conv2d_6", "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_8", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [1, 1], "filters": 64, "name": "conv2d_8", "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_10", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [1, 1], "filters": 64, "name": "conv2d_10", "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_12", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [1, 1], "filters": 64, "name": "conv2d_12", "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_14", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [1, 1], "filters": 64, "name": "conv2d_14", "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_16", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [1, 1], "filters": 64, "name": "conv2d_16", "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_2", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99}}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_4", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99}}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_6", "config": {"epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_6", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99}}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_8", "config": {"epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_8", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99}}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_10", "config": {"epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_10", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99}}, {"inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_12", "config": {"epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_12", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99}}, {"inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_14", "config": {"epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_14", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99}}, {"inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_16", "config": {"epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_16", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99}}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "Activation", "name": "activation_2", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "Activation", "name": "activation_4", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "class_name": "Activation", "name": "activation_6", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "class_name": "Activation", "name": "activation_8", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "class_name": "Activation", "name": "activation_10", "config": {"activation": "relu", "trainable": true, "name": "activation_10"}}, {"inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "class_name": "Activation", "name": "activation_12", "config": {"activation": "relu", "trainable": true, "name": "activation_12"}}, {"inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "class_name": "Activation", "name": "activation_14", "config": {"activation": "relu", "trainable": true, "name": "activation_14"}}, {"inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "class_name": "Activation", "name": "activation_16", "config": {"activation": "relu", "trainable": true, "name": "activation_16"}}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_3", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 64, "name": "conv2d_3", "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_5", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 64, "name": "conv2d_5", "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_6", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_7", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 64, "name": "conv2d_7", "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_8", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_9", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 64, "name": "conv2d_9", "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_10", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_11", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 64, "name": "conv2d_11", "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_12", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_13", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 64, "name": "conv2d_13", "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_14", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_15", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 64, "name": "conv2d_15", "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_16", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_17", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 64, "name": "conv2d_17", "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_3", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99}}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_5", "config": {"epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_5", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99}}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_7", "config": {"epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_7", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99}}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_9", "config": {"epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_9", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99}}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_11", "config": {"epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_11", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99}}, {"inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_13", "config": {"epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_13", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99}}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_15", "config": {"epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_15", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99}}, {"inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_17", "config": {"epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_17", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99}}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "Activation", "name": "activation_3", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "Activation", "name": "activation_5", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "class_name": "Activation", "name": "activation_7", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}}, {"inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "class_name": "Activation", "name": "activation_9", "config": {"activation": "relu", "trainable": true, "name": "activation_9"}}, {"inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "class_name": "Activation", "name": "activation_11", "config": {"activation": "relu", "trainable": true, "name": "activation_11"}}, {"inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "class_name": "Activation", "name": "activation_13", "config": {"activation": "relu", "trainable": true, "name": "activation_13"}}, {"inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "class_name": "Activation", "name": "activation_15", "config": {"activation": "relu", "trainable": true, "name": "activation_15"}}, {"inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "class_name": "Activation", "name": "activation_17", "config": {"activation": "relu", "trainable": true, "name": "activation_17"}}, {"inbound_nodes": [[["activation_3", 0, 0, {}], ["activation_5", 0, 0, {}], ["activation_7", 0, 0, {}], ["activation_9", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_17", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_1", "config": {"axis": 3, "trainable": true, "name": "concatenate_1"}}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_18", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [1, 1], "filters": 64, "name": "conv2d_18", "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_18", "config": {"epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_18", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99}}, {"inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "class_name": "GlobalAveragePooling2D", "name": "global_average_pooling2d_1", "config": {"data_format": "channels_last", "trainable": true, "name": "global_average_pooling2d_1"}}, {"inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_1", "config": {"bias_constraint": null, "kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "units": 16, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Activation", "name": "activation_18", "config": {"activation": "relu", "trainable": true, "name": "activation_18"}}, {"inbound_nodes": [[["activation_18", 0, 0, {}]]], "class_name": "Dense", "name": "dense_2", "config": {"bias_constraint": null, "kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "units": 64, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Activation", "name": "activation_19", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_19"}}, {"inbound_nodes": [[["activation_19", 0, 0, {}]]], "class_name": "Reshape", "name": "reshape_1", "config": {"target_shape": [1, 1, 64], "trainable": true, "name": "reshape_1"}}, {"inbound_nodes": [[["batch_normalization_18", 0, 0, {}], ["reshape_1", 0, 0, {}]]], "class_name": "Multiply", "name": "multiply_1", "config": {"trainable": true, "name": "multiply_1"}}, {"inbound_nodes": [[["activation_1", 0, 0, {}], ["multiply_1", 0, 0, {}]]], "class_name": "Add", "name": "add_1", "config": {"trainable": true, "name": "add_1"}}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "Activation", "name": "activation_20", "config": {"activation": "relu", "trainable": true, "name": "activation_20"}}, {"inbound_nodes": [[["activation_20", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_19", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [1, 1], "filters": 64, "name": "conv2d_19", "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_20", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_21", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [1, 1], "filters": 64, "name": "conv2d_21", "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_20", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_23", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [1, 1], "filters": 64, "name": "conv2d_23", "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_20", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_25", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [1, 1], "filters": 64, "name": "conv2d_25", "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_20", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_27", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [1, 1], "filters": 64, "name": "conv2d_27", "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_20", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_29", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [1, 1], "filters": 64, "name": "conv2d_29", "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_20", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_31", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [1, 1], "filters": 64, "name": "conv2d_31", "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_20", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_33", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [1, 1], "filters": 64, "name": "conv2d_33", "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_19", "config": {"epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_19", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99}}, {"inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_21", "config": {"epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_21", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99}}, {"inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_23", "config": {"epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_23", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99}}, {"inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_25", "config": {"epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_25", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99}}, {"inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_27", "config": {"epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_27", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99}}, {"inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_29", "config": {"epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_29", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99}}, {"inbound_nodes": [[["conv2d_31", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_31", "config": {"epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_31", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99}}, {"inbound_nodes": [[["conv2d_33", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_33", "config": {"epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_33", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99}}, {"inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "class_name": "Activation", "name": "activation_21", "config": {"activation": "relu", "trainable": true, "name": "activation_21"}}, {"inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "class_name": "Activation", "name": "activation_23", "config": {"activation": "relu", "trainable": true, "name": "activation_23"}}, {"inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "class_name": "Activation", "name": "activation_25", "config": {"activation": "relu", "trainable": true, "name": "activation_25"}}, {"inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "class_name": "Activation", "name": "activation_27", "config": {"activation": "relu", "trainable": true, "name": "activation_27"}}, {"inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]], "class_name": "Activation", "name": "activation_29", "config": {"activation": "relu", "trainable": true, "name": "activation_29"}}, {"inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "class_name": "Activation", "name": "activation_31", "config": {"activation": "relu", "trainable": true, "name": "activation_31"}}, {"inbound_nodes": [[["batch_normalization_31", 0, 0, {}]]], "class_name": "Activation", "name": "activation_33", "config": {"activation": "relu", "trainable": true, "name": "activation_33"}}, {"inbound_nodes": [[["batch_normalization_33", 0, 0, {}]]], "class_name": "Activation", "name": "activation_35", "config": {"activation": "relu", "trainable": true, "name": "activation_35"}}, {"inbound_nodes": [[["activation_21", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_20", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 64, "name": "conv2d_20", "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_23", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_22", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 64, "name": "conv2d_22", "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_25", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_24", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 64, "name": "conv2d_24", "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_27", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_26", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 64, "name": "conv2d_26", "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_29", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_28", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 64, "name": "conv2d_28", "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_31", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_30", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 64, "name": "conv2d_30", "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_33", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_32", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 64, "name": "conv2d_32", "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["activation_35", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_34", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "kernel_size": [3, 3], "filters": 64, "name": "conv2d_34", "kernel_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "use_bias": true, "padding": "same", "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_20", "config": {"epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_20", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99}}, {"inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_22", "config": {"epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_22", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99}}, {"inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_24", "config": {"epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_24", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99}}, {"inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_26", "config": {"epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_26", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99}}, {"inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_28", "config": {"epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": "batch_normalization_28", "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "momentum": 0.99}}, {"inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_30", "config": {"epsilon": 0.001, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "name": 